tutorials/NTNU_LES/constant/airfoilProperties/Re101000
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile 
{ 
    version     2.0; 
    format      ascii; 
    class       dictionary; 
    object      airfoilProperties; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

airfoilData
(
//   alpha   C_l    C_d
	(	-180.00000	0.00000		0.00000		)
	(	-175.00000	0.17365		0.00760		)
	(	-170.00000	0.34202		0.03015		)
	(	-165.00000	0.50000		0.06699		)
	(	-160.00000	0.64279		0.11698		)
	(	-155.00000	0.76604		0.17861		)
	(	-150.00000	0.86603		0.25000		)
	(	-145.00000	0.93969		0.32899		)
	(	-140.00000	0.98481		0.41318		)
	(	-135.00000	1.00000		0.50000		)
	(	-130.00000	0.98481		0.58682		)
	(	-125.00000	0.93969		0.67101		)
	(	-120.00000	0.86603		0.75000		)
	(	-115.00000	0.76604		0.82139		)
	(	-110.00000	0.64279		0.88302		)
	(	-105.00000	0.50000		0.93301		)
	(	-100.00000	0.34202		0.96985		)
	(	-95.00000	0.17365		0.99240		)
	(	-90.00000	0.00000		1.00000		)
	(	-85.00000	-0.17365	0.99240		)
	(	-80.00000	-0.34202	0.96985		)
	(	-75.00000	-0.50000	0.93301		)
	(	-70.00000	-0.64279	0.88302		)
	(	-65.00000	-0.76604	0.82139		)
	(	-60.00000	-0.86603	0.75000		)
	(	-55.00000	-0.93969	0.67101		)
	(	-50.00000	-0.98481	0.58682		)
	(	-45.00000	-1.00000	0.50000		)
	(	-40.00000	-0.98481	0.41318		)
	(	-35.00000	-0.93969	0.32899		)
	(	-30.00000	-0.86603	0.25000		)
	(	-25.00000	-0.76604	0.17861		)
	(	-20.00000	-0.64279	0.11698		)
	(	-15.00000	-0.50000	0.06699		)
	(	-10.00000	-0.35630	0.11801		)
	(	-9.00000	-0.35250	0.10774		)
	(	-8.00000	-0.41550	0.10099		)
	(	-7.00000	-0.49550	0.09199		)
	(	-5.00000	-0.23060	0.03691		)
	(	-4.00000	-0.07390	0.02770		)
	(	-3.00000	0.03420		0.02923		)
	(	-2.00000	0.12680		0.03149		)
	(	0.00000		0.44890		0.02650		)
	(	1.00000		0.56340		0.02688		)
	(	2.00000		0.73260		0.02572		)
	(	3.00000		0.81010		0.02871		)
	(	4.00000		0.95580		0.02825		)
	(	5.00000		1.04600		0.02969		)
	(	6.00000		1.16370		0.02896		)
	(	7.00000		1.29960		0.02605		)
	(	8.00000		1.37950		0.02365		)
	(	9.00000		1.38960		0.02652		)
	(	10.00000	1.36200		0.03609		)
	(	11.00000	1.36860		0.04584		)
	(	12.00000	1.41100		0.05781		)
	(	13.00000	1.40410		0.06949		)
	(	16.00000	1.19720		0.14905		)
	(	17.00000	1.09270		0.21754		)
	(	18.00000	1.09400		0.26421		)
	(	19.00000	1.08960		0.28746		)
	(	20.00000	1.07440		0.30901		)
	(	25.00000	0.76604		0.17861		)
	(	30.00000	0.86603		0.25000		)
	(	35.00000	0.93969		0.32899		)
	(	40.00000	0.98481		0.41318		)
	(	45.00000	1.00000		0.50000		)
	(	50.00000	0.98481		0.58682		)
	(	55.00000	0.93969		0.67101		)
	(	60.00000	0.86603		0.75000		)
	(	65.00000	0.76604		0.82139		)
	(	70.00000	0.64279		0.88302		)
	(	75.00000	0.50000		0.93301		)
	(	80.00000	0.34202		0.96985		)
	(	85.00000	0.17365		0.99240		)
	(	90.00000	0.00000		1.00000		)
	(	95.00000	-0.17365	0.99240		)
	(	100.00000	-0.34202	0.96985		)
	(	105.00000	-0.50000	0.93301		)
	(	110.00000	-0.64279	0.88302		)
	(	115.00000	-0.76604	0.82139		)
	(	120.00000	-0.86603	0.75000		)
	(	125.00000	-0.93969	0.67101		)
	(	130.00000	-0.98481	0.58682		)
	(	135.00000	-1.00000	0.50000		)
	(	140.00000	-0.98481	0.41318		)
	(	145.00000	-0.93969	0.32899		)
	(	150.00000	-0.86603	0.25000		)
	(	155.00000	-0.76604	0.17861		)
	(	160.00000	-0.64279	0.11698		)
	(	165.00000	-0.50000	0.06699		)
	(	170.00000	-0.34202	0.03015		)
	(	175.00000	-0.17365	0.00760		)
	(	180.00000	0.00000		0.00000		)

);

// ************************************************************************* //
