tutorials/NTNU_LES/constant/airfoilProperties/Re102000
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile 
{ 
    version     2.0; 
    format      ascii; 
    class       dictionary; 
    object      airfoilProperties; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

airfoilData
(
	//   alpha   C_l    C_d
	(	-180.00000	0.00000	0.00000		)
	(	-175.00000	0.17365	0.00760		)
	(	-170.00000	0.34202	0.03015		)
	(	-165.00000	0.50000	0.06699		)
	(	-160.00000	0.64279	0.11698		)
	(	-155.00000	0.76604	0.17861		)
	(	-150.00000	0.86603	0.25000		)
	(	-145.00000	0.93969	0.32899		)
	(	-140.00000	0.98481	0.41318		)
	(	-135.00000	1.00000	0.50000		)
	(	-130.00000	0.98481	0.58682		)
	(	-125.00000	0.93969	0.67101		)
	(	-120.00000	0.86603	0.75000		)
	(	-115.00000	0.76604	0.82139		)
	(	-110.00000	0.64279	0.88302		)
	(	-105.00000	0.50000	0.93301		)
	(	-100.00000	0.34202	0.96985		)
	(	-95.00000	0.17365	0.99240		)
	(	-90.00000	0.00000	1.00000		)
	(	-85.00000	-0.17365	0.99240		)
	(	-80.00000	-0.34202	0.96985		)
	(	-75.00000	-0.50000	0.93301		)
	(	-70.00000	-0.64279	0.88302		)
	(	-65.00000	-0.76604	0.82139		)
	(	-60.00000	-0.86603	0.75000		)
	(	-55.00000	-0.93969	0.67101		)
	(	-50.00000	-0.98481	0.58682		)
	(	-45.00000	-1.00000	0.50000		)
	(	-40.00000	-0.98481	0.41318		)
	(	-35.00000	-0.93969	0.32899		)
	(	-30.00000	-0.86603	0.25000		)
	(	-25.00000	-0.76604	0.17861		)
	(	-20.00000	-0.64279	0.11698		)
	(	-15.00000	-0.50000	0.06699		)
	(	-10.00000	-0.36330	0.11787		)
	(	-9.00000	-0.35250	0.10753		)
	(	-8.00000	-0.40880	0.09985		)
	(	-7.00000	-0.49230	0.09151		)
	(	-5.00000	-0.22750	0.03711		)
	(	-4.00000	-0.07120	0.02745		)
	(	-3.00000	0.03770	0.02903		)
	(	-2.00000	0.13030	0.03117		)
	(	0.00000	0.45680	0.02614		)
	(	1.00000	0.57120	0.02647		)
	(	2.00000	0.73890	0.02537		)
	(	3.00000	0.81730	0.02820		)
	(	4.00000	0.95650	0.02804		)
	(	5.00000	1.05470	0.02909		)
	(	6.00000	1.17060	0.02846		)
	(	7.00000	1.30430	0.02570		)
	(	8.00000	1.38180	0.02351		)
	(	9.00000	1.38980	0.02646		)
	(	10.00000	1.36210	0.03603		)
	(	11.00000	1.36850	0.04576		)
	(	12.00000	1.40990	0.05758		)
	(	13.00000	1.40410	0.06954		)
	(	14.00000	1.34410	0.09367		)
	(	16.00000	1.19570	0.14943		)
	(	17.00000	1.09260	0.21773		)
	(	18.00000	1.09370	0.26415		)
	(	19.00000	1.08540	0.28621		)
	(	20.00000	1.07540	0.30878		)
	(	25.00000	0.76604	0.17861		)
	(	30.00000	0.86603	0.25000		)
	(	35.00000	0.93969	0.32899		)
	(	40.00000	0.98481	0.41318		)
	(	45.00000	1.00000	0.50000		)
	(	50.00000	0.98481	0.58682		)
	(	55.00000	0.93969	0.67101		)
	(	60.00000	0.86603	0.75000		)
	(	65.00000	0.76604	0.82139		)
	(	70.00000	0.64279	0.88302		)
	(	75.00000	0.50000	0.93301		)
	(	80.00000	0.34202	0.96985		)
	(	85.00000	0.17365	0.99240		)
	(	90.00000	0.00000	1.00000		)
	(	95.00000	-0.17365	0.99240		)
	(	100.00000	-0.34202	0.96985		)
	(	105.00000	-0.50000	0.93301		)
	(	110.00000	-0.64279	0.88302		)
	(	115.00000	-0.76604	0.82139		)
	(	120.00000	-0.86603	0.75000		)
	(	125.00000	-0.93969	0.67101		)
	(	130.00000	-0.98481	0.58682		)
	(	135.00000	-1.00000	0.50000		)
	(	140.00000	-0.98481	0.41318		)
	(	145.00000	-0.93969	0.32899		)
	(	150.00000	-0.86603	0.25000		)
	(	155.00000	-0.76604	0.17861		)
	(	160.00000	-0.64279	0.11698		)
	(	165.00000	-0.50000	0.06699		)
	(	170.00000	-0.34202	0.03015		)
	(	175.00000	-0.17365	0.00760		)
	(	180.00000	0.00000	0.00000		)

);

// ************************************************************************* //
