tutorials/NTNU_LES/constant/airfoilProperties/Re103000
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  1.6                                   | 
|   \  /    A nd           | Web:      http://www.OpenFOAM.org               | 
|    \/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
    version     2.0; 
    format      ascii; 
    class       dictionary; 
    object      airfoilProperties; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

airfoilData
(
//   alpha   C_l    C_d
(	-180.00000	0.00000	0.00000		)
(	-175.00000	0.17365	0.00760		)
(	-170.00000	0.34202	0.03015		)
(	-165.00000	0.50000	0.06699		)
(	-160.00000	0.64279	0.11698		)
(	-155.00000	0.76604	0.17861		)
(	-150.00000	0.86603	0.25000		)
(	-145.00000	0.93969	0.32899		)
(	-140.00000	0.98481	0.41318		)
(	-135.00000	1.00000	0.50000		)
(	-130.00000	0.98481	0.58682		)
(	-125.00000	0.93969	0.67101		)
(	-120.00000	0.86603	0.75000		)
(	-115.00000	0.76604	0.82139		)
(	-110.00000	0.64279	0.88302		)
(	-105.00000	0.50000	0.93301		)
(	-100.00000	0.34202	0.96985		)
(	-95.00000	0.17365	0.99240		)
(	-90.00000	0.00000	1.00000		)
(	-85.00000	-0.17365	0.99240		)
(	-80.00000	-0.34202	0.96985		)
(	-75.00000	-0.50000	0.93301		)
(	-70.00000	-0.64279	0.88302		)
(	-65.00000	-0.76604	0.82139		)
(	-60.00000	-0.86603	0.75000		)
(	-55.00000	-0.93969	0.67101		)
(	-50.00000	-0.98481	0.58682		)
(	-45.00000	-1.00000	0.50000		)
(	-40.00000	-0.98481	0.41318		)
(	-35.00000	-0.93969	0.32899		)
(	-30.00000	-0.86603	0.25000		)
(	-25.00000	-0.76604	0.17861		)
(	-20.00000	-0.64279	0.11698		)
(	-15.00000	-0.50000	0.06699		)
(	-10.00000	-0.37350	0.11820		)
(	-9.00000	-0.35300	0.10732		)
(	-8.00000	-0.40140	0.09855		)
(	-7.00000	-0.48930	0.09106		)
(	-6.00000	-0.41480	0.06033		)
(	-3.00000	0.04120	0.02883		)
(	-2.00000	0.13380	0.03086		)
(	0.00000	0.46450	0.02579		)
(	1.00000	0.57850	0.02608		)
(	2.00000	0.74490	0.02505		)
(	3.00000	0.82400	0.02772		)
(	4.00000	0.95760	0.02782		)
(	5.00000	1.06280	0.02852		)
(	6.00000	1.17730	0.02797		)
(	7.00000	1.30870	0.02539		)
(	8.00000	1.38390	0.02337		)
(	9.00000	1.38990	0.02641		)
(	10.00000	1.36220	0.03598		)
(	11.00000	1.36830	0.04569		)
(	12.00000	1.40880	0.05736		)
(	13.00000	1.40420	0.06968		)
(	14.00000	1.34580	0.09302		)
(	15.00000	1.26590	0.11782		)
(	16.00000	1.12840	0.17542		)
(	17.00000	1.09250	0.21791		)
(	18.00000	1.09340	0.26408		)
(	19.00000	1.08140	0.28523		)
(	20.00000	1.07660	0.30851		)
(	25.00000	0.76604	0.17861		)
(	30.00000	0.86603	0.25000		)
(	35.00000	0.93969	0.32899		)
(	40.00000	0.98481	0.41318		)
(	45.00000	1.00000	0.50000		)
(	50.00000	0.98481	0.58682		)
(	55.00000	0.93969	0.67101		)
(	60.00000	0.86603	0.75000		)
(	65.00000	0.76604	0.82139		)
(	70.00000	0.64279	0.88302		)
(	75.00000	0.50000	0.93301		)
(	80.00000	0.34202	0.96985		)
(	85.00000	0.17365	0.99240		)
(	90.00000	0.00000	1.00000		)
(	95.00000	-0.17365	0.99240		)
(	100.00000	-0.34202	0.96985		)
(	105.00000	-0.50000	0.93301		)
(	110.00000	-0.64279	0.88302		)
(	115.00000	-0.76604	0.82139		)
(	120.00000	-0.86603	0.75000		)
(	125.00000	-0.93969	0.67101		)
(	130.00000	-0.98481	0.58682		)
(	135.00000	-1.00000	0.50000		)
(	140.00000	-0.98481	0.41318		)
(	145.00000	-0.93969	0.32899		)
(	150.00000	-0.86603	0.25000		)
(	155.00000	-0.76604	0.17861		)
(	160.00000	-0.64279	0.11698		)
(	165.00000	-0.50000	0.06699		)
(	170.00000	-0.34202	0.03015		)
(	175.00000	-0.17365	0.00760		)
(	180.00000	0.00000	0.00000		)

);

// ************************************************************************* //
