tutorials/NTNU_LES/constant/airfoilProperties/Re65000
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile 
{ 
    version     2.0; 
    format      ascii; 
    class       dictionary; 
    object      airfoilProperties; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

airfoilData
(
//   alpha   C_l    C_d
(	-180.00000	0.00000	0.00000		)
(	-175.00000	0.17365	0.00760		)
(	-170.00000	0.34202	0.03015		)
(	-165.00000	0.50000	0.06699		)
(	-160.00000	0.64279	0.11698		)
(	-155.00000	0.76604	0.17861		)
(	-150.00000	0.86603	0.25000		)
(	-145.00000	0.93969	0.32899		)
(	-140.00000	0.98481	0.41318		)
(	-135.00000	1.00000	0.50000		)
(	-130.00000	0.98481	0.58682		)
(	-125.00000	0.93969	0.67101		)
(	-120.00000	0.86603	0.75000		)
(	-115.00000	0.76604	0.82139		)
(	-110.00000	0.64279	0.88302		)
(	-105.00000	0.50000	0.93301		)
(	-100.00000	0.34202	0.96985		)
(	-95.00000	0.17365	0.99240		)
(	-90.00000	0.00000	1.00000		)
(	-85.00000	-0.17365	0.99240		)
(	-80.00000	-0.34202	0.96985		)
(	-75.00000	-0.50000	0.93301		)
(	-70.00000	-0.64279	0.88302		)
(	-65.00000	-0.76604	0.82139		)
(	-60.00000	-0.86603	0.75000		)
(	-55.00000	-0.93969	0.67101		)
(	-50.00000	-0.98481	0.58682		)
(	-45.00000	-1.00000	0.50000		)
(	-40.00000	-0.98481	0.41318		)
(	-35.00000	-0.93969	0.32899		)
(	-30.00000	-0.86603	0.25000		)
(	-25.00000	-0.76604	0.17861		)
(	-20.00000	-0.64279	0.11698		)
(	-15.00000	-0.50000	0.06699		)
(	-10.00000	-0.35280	0.12425		)
(	-9.00000	-0.37660	0.11963		)
(	-8.00000	-0.40280	0.11223		)
(	-7.00000	-0.35010	0.09871		)
(	-4.00000	-0.22470	0.03620		)
(	-3.00000	-0.09370	0.03418		)
(	-2.00000	-0.07210	0.04144		)
(	-1.00000	0.02480	0.04143		)
(	0.00000	0.14090	0.04169		)
(	1.00000	0.26940	0.04348		)
(	2.00000	0.40730	0.04491		)
(	3.00000	0.47970	0.04844		)
(	4.00000	0.64360	0.05094		)
(	5.00000	0.69510	0.05554		)
(	6.00000	0.79340	0.05922		)
(	8.00000	1.26930	0.03979		)
(	9.00000	1.37450	0.03202		)
(	10.00000	1.34370	0.04009		)
(	11.00000	1.37850	0.05070		)
(	12.00000	1.43270	0.06486		)
(	13.00000	1.37680	0.08281		)
(	14.00000	1.28230	0.10675		)
(	15.00000	1.09730	0.16683		)
(	16.00000	1.07600	0.22196		)
(	17.00000	1.05080	0.24361		)
(	18.00000	1.06740	0.26595		)
(	19.00000	1.07570	0.28552		)
(	20.00000	1.08320	0.31759		)
(	25.00000	0.76604	0.17861		)
(	30.00000	0.86603	0.25000		)
(	35.00000	0.93969	0.32899		)
(	40.00000	0.98481	0.41318		)
(	45.00000	1.00000	0.50000		)
(	50.00000	0.98481	0.58682		)
(	55.00000	0.93969	0.67101		)
(	60.00000	0.86603	0.75000		)
(	65.00000	0.76604	0.82139		)
(	70.00000	0.64279	0.88302		)
(	75.00000	0.50000	0.93301		)
(	80.00000	0.34202	0.96985		)
(	85.00000	0.17365	0.99240		)
(	90.00000	0.00000	1.00000		)
(	95.00000	-0.17365	0.99240		)
(	100.00000	-0.34202	0.96985		)
(	105.00000	-0.50000	0.93301		)
(	110.00000	-0.64279	0.88302		)
(	115.00000	-0.76604	0.82139		)
(	120.00000	-0.86603	0.75000		)
(	125.00000	-0.93969	0.67101		)
(	130.00000	-0.98481	0.58682		)
(	135.00000	-1.00000	0.50000		)
(	140.00000	-0.98481	0.41318		)
(	145.00000	-0.93969	0.32899		)
(	150.00000	-0.86603	0.25000		)
(	155.00000	-0.76604	0.17861		)
(	160.00000	-0.64279	0.11698		)
(	165.00000	-0.50000	0.06699		)
(	170.00000	-0.34202	0.03015		)
(	175.00000	-0.17365	0.00760		)
(	180.00000	0.00000	0.00000		)
);

// ************************************************************************* //
