tutorials/NTNU_LES/constant/airfoilProperties/Re91000
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile 
{ 
    version     2.0; 
    format      ascii; 
    class       dictionary; 
    object      airfoilProperties; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

airfoilData
(
//   alpha   C_l    C_d
(	-180.00000	0.00000	0.00000		)
(	-175.00000	0.17365	0.00760		)
(	-170.00000	0.34202	0.03015		)
(	-165.00000	0.50000	0.06699		)
(	-160.00000	0.64279	0.11698		)
(	-155.00000	0.76604	0.17861		)
(	-150.00000	0.86603	0.25000		)
(	-145.00000	0.93969	0.32899		)
(	-140.00000	0.98481	0.41318		)
(	-135.00000	1.00000	0.50000		)
(	-130.00000	0.98481	0.58682		)
(	-125.00000	0.93969	0.67101		)
(	-120.00000	0.86603	0.75000		)
(	-115.00000	0.76604	0.82139		)
(	-110.00000	0.64279	0.88302		)
(	-105.00000	0.50000	0.93301		)
(	-100.00000	0.34202	0.96985		)
(	-95.00000	0.17365	0.99240		)
(	-90.00000	0.00000	1.00000		)
(	-85.00000	-0.17365	0.99240		)
(	-80.00000	-0.34202	0.96985		)
(	-75.00000	-0.50000	0.93301		)
(	-70.00000	-0.64279	0.88302		)
(	-65.00000	-0.76604	0.82139		)
(	-60.00000	-0.86603	0.75000		)
(	-55.00000	-0.93969	0.67101		)
(	-50.00000	-0.98481	0.58682		)
(	-45.00000	-1.00000	0.50000		)
(	-40.00000	-0.98481	0.41318		)
(	-35.00000	-0.93969	0.32899		)
(	-30.00000	-0.86603	0.25000		)
(	-25.00000	-0.76604	0.17861		)
(	-20.00000	-0.64279	0.11698		)
(	-15.00000	-0.50000	0.06699		)
(	-10.00000	-0.34220	0.12041		)
(	-9.00000	-0.38790	0.11499		)
(	-8.00000	-0.37770	0.09829		)
(	-7.00000	-0.43830	0.09133		)
(	-4.00000	-0.09050	0.02895		)
(	-2.00000	0.08460	0.03401		)
(	0.00000	0.36370	0.03079		)
(	1.00000	0.47780	0.03193		)
(	2.00000	0.65210	0.03075		)
(	3.00000	0.70800	0.03461		)
(	4.00000	0.87510	0.03321		)
(	5.00000	0.93310	0.03751		)
(	6.00000	1.06410	0.03645		)
(	7.00000	1.24260	0.03070		)
(	8.00000	1.37420	0.02527		)
(	9.00000	1.38930	0.02714		)
(	10.00000	1.35810	0.03701		)
(	11.00000	1.37000	0.04685		)
(	15.00000	1.27780	0.11564		)
(	16.00000	1.12640	0.17417		)
(	17.00000	1.10170	0.21395		)
(	18.00000	1.07070	0.25918		)
(	19.00000	1.09920	0.29238		)
(	20.00000	1.07590	0.31139		)
(	25.00000	0.76604	0.17861		)
(	30.00000	0.86603	0.25000		)
(	35.00000	0.93969	0.32899		)
(	40.00000	0.98481	0.41318		)
(	45.00000	1.00000	0.50000		)
(	50.00000	0.98481	0.58682		)
(	55.00000	0.93969	0.67101		)
(	60.00000	0.86603	0.75000		)
(	65.00000	0.76604	0.82139		)
(	70.00000	0.64279	0.88302		)
(	75.00000	0.50000	0.93301		)
(	80.00000	0.34202	0.96985		)
(	85.00000	0.17365	0.99240		)
(	90.00000	0.00000	1.00000		)
(	95.00000	-0.17365	0.99240		)
(	100.00000	-0.34202	0.96985		)
(	105.00000	-0.50000	0.93301		)
(	110.00000	-0.64279	0.88302		)
(	115.00000	-0.76604	0.82139		)
(	120.00000	-0.86603	0.75000		)
(	125.00000	-0.93969	0.67101		)
(	130.00000	-0.98481	0.58682		)
(	135.00000	-1.00000	0.50000		)
(	140.00000	-0.98481	0.41318		)
(	145.00000	-0.93969	0.32899		)
(	150.00000	-0.86603	0.25000		)
(	155.00000	-0.76604	0.17861		)
(	160.00000	-0.64279	0.11698		)
(	165.00000	-0.50000	0.06699		)
(	170.00000	-0.34202	0.03015		)
(	175.00000	-0.17365	0.00760		)
(	180.00000	0.00000	0.00000		)


);

// ************************************************************************* //
