tutorials/NTNU_LES/constant/airfoilProperties/Re96000
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile 
{ 
    version     2.0; 
    format      ascii; 
    class       dictionary; 
    object      airfoilProperties; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

airfoilData
(
//   alpha   C_l    C_d

(	-180.00000	0.00000	0.00000		)
(	-175.00000	0.17365	0.00760		)
(	-170.00000	0.34202	0.03015		)
(	-165.00000	0.50000	0.06699		)
(	-160.00000	0.64279	0.11698		)
(	-155.00000	0.76604	0.17861		)
(	-150.00000	0.86603	0.25000		)
(	-145.00000	0.93969	0.32899		)
(	-140.00000	0.98481	0.41318		)
(	-135.00000	1.00000	0.50000		)
(	-130.00000	0.98481	0.58682		)
(	-125.00000	0.93969	0.67101		)
(	-120.00000	0.86603	0.75000		)
(	-115.00000	0.76604	0.82139		)
(	-110.00000	0.64279	0.88302		)
(	-105.00000	0.50000	0.93301		)
(	-100.00000	0.34202	0.96985		)
(	-95.00000	0.17365	0.99240		)
(	-90.00000	0.00000	1.00000		)
(	-85.00000	-0.17365	0.99240		)
(	-80.00000	-0.34202	0.96985		)
(	-75.00000	-0.50000	0.93301		)
(	-70.00000	-0.64279	0.88302		)
(	-65.00000	-0.76604	0.82139		)
(	-60.00000	-0.86603	0.75000		)
(	-55.00000	-0.93969	0.67101		)
(	-50.00000	-0.98481	0.58682		)
(	-45.00000	-1.00000	0.50000		)
(	-40.00000	-0.98481	0.41318		)
(	-35.00000	-0.93969	0.32899		)
(	-30.00000	-0.86603	0.25000		)
(	-25.00000	-0.76604	0.17861		)
(	-20.00000	-0.64279	0.11698		)
(	-15.00000	-0.50000	0.06699		)
(	-10.00000	-0.34220	0.12041		)
(	-9.00000	-0.38790	0.11499		)
(	-8.00000	-0.37770	0.09829		)
(	-7.00000	-0.44060	0.08968		)
(	-6.00000	-0.43530	0.06973		)
(	-5.00000	-0.24440	0.03621		)
(	-4.00000	-0.08750	0.02871		)
(	-3.00000	0.01650	0.03022		)
(	-2.00000	0.11060	0.03349		)
(	0.00000	0.40600	0.02850		)
(	1.00000	0.51970	0.02921		)
(	2.00000	0.69640	0.02787		)
(	3.00000	0.76600	0.03113		)
(	4.00000	0.92510	0.03004		)
(	5.00000	0.99850	0.03313		)
(	6.00000	1.12600	0.03189		)
(	7.00000	1.27240	0.02816		)
(	8.00000	1.37370	0.02437		)
(	9.00000	1.38840	0.02684		)
(	10.00000	1.36050	0.03648		)
(	11.00000	1.36920	0.04630		)
(	12.00000	1.41620	0.05869		)
(	13.00000	1.40280	0.07061		)
(	14.00000	1.35970	0.09152		)
(	15.00000	1.28430	0.11493		)
(	16.00000	1.12490	0.17587		)
(	17.00000	1.09350	0.21663		)
(	18.00000	1.08790	0.25690		)
(	19.00000	1.09650	0.29091		)
(	20.00000	1.07130	0.30974		)
(	25.00000	0.76604	0.17861		)
(	30.00000	0.86603	0.25000		)
(	35.00000	0.93969	0.32899		)
(	40.00000	0.98481	0.41318		)
(	45.00000	1.00000	0.50000		)
(	50.00000	0.98481	0.58682		)
(	55.00000	0.93969	0.67101		)
(	60.00000	0.86603	0.75000		)
(	65.00000	0.76604	0.82139		)
(	70.00000	0.64279	0.88302		)
(	75.00000	0.50000	0.93301		)
(	80.00000	0.34202	0.96985		)
(	85.00000	0.17365	0.99240		)
(	90.00000	0.00000	1.00000		)
(	95.00000	-0.17365	0.99240		)
(	100.00000	-0.34202	0.96985		)
(	105.00000	-0.50000	0.93301		)
(	110.00000	-0.64279	0.88302		)
(	115.00000	-0.76604	0.82139		)
(	120.00000	-0.86603	0.75000		)
(	125.00000	-0.93969	0.67101		)
(	130.00000	-0.98481	0.58682		)
(	135.00000	-1.00000	0.50000		)
(	140.00000	-0.98481	0.41318		)
(	145.00000	-0.93969	0.32899		)
(	150.00000	-0.86603	0.25000		)
(	155.00000	-0.76604	0.17861		)
(	160.00000	-0.64279	0.11698		)
(	165.00000	-0.50000	0.06699		)
(	170.00000	-0.34202	0.03015		)
(	175.00000	-0.17365	0.00760		)
(	180.00000	0.00000	0.00000		)

);

// ************************************************************************* //
