tutorials/NTNU_LES/constant/airfoilProperties/Re99000
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile 
{ 
    version     2.0; 
    format      ascii; 
    class       dictionary; 
    object      airfoilProperties; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

airfoilData
(
//   alpha   C_l    C_d
(	-180.00000	0.00000	0.00000		)
(	-175.00000	0.17365	0.00760		)
(	-170.00000	0.34202	0.03015		)
(	-165.00000	0.50000	0.06699		)
(	-160.00000	0.64279	0.11698		)
(	-155.00000	0.76604	0.17861		)
(	-150.00000	0.86603	0.25000		)
(	-145.00000	0.93969	0.32899		)
(	-140.00000	0.98481	0.41318		)
(	-135.00000	1.00000	0.50000		)
(	-130.00000	0.98481	0.58682		)
(	-125.00000	0.93969	0.67101		)
(	-120.00000	0.86603	0.75000		)
(	-115.00000	0.76604	0.82139		)
(	-110.00000	0.64279	0.88302		)
(	-105.00000	0.50000	0.93301		)
(	-100.00000	0.34202	0.96985		)
(	-95.00000	0.17365	0.99240		)
(	-90.00000	0.00000	1.00000		)
(	-85.00000	-0.17365	0.99240		)
(	-80.00000	-0.34202	0.96985		)
(	-75.00000	-0.50000	0.93301		)
(	-70.00000	-0.64279	0.88302		)
(	-65.00000	-0.76604	0.82139		)
(	-60.00000	-0.86603	0.75000		)
(	-55.00000	-0.93969	0.67101		)
(	-50.00000	-0.98481	0.58682		)
(	-45.00000	-1.00000	0.50000		)
(	-40.00000	-0.98481	0.41318		)
(	-35.00000	-0.93969	0.32899		)
(	-30.00000	-0.86603	0.25000		)
(	-25.00000	-0.76604	0.17861		)
(	-20.00000	-0.64279	0.11698		)
(	-15.00000	-0.50000	0.06699		)
(	-10.00000	-0.34930	0.11840		)
(	-9.00000	-0.35350	0.10810		)
(	-8.00000	-0.42450	0.10226		)
(	-7.00000	-0.50120	0.09281		)
(	-6.00000	-0.42470	0.06412		)
(	-5.00000	-0.23540	0.03661		)
(	-4.00000	-0.07810	0.02811		)
(	-3.00000	0.02860	0.02955		)
(	-2.00000	0.12150	0.03204		)
(	0.00000	0.43560	0.02711		)
(	1.00000	0.54990	0.02758		)
(	2.00000	0.72180	0.02633		)
(	3.00000	0.79870	0.02942		)
(	4.00000	0.95220	0.02861		)
(	5.00000	1.03200	0.03071		)
(	6.00000	1.15240	0.02981		)
(	7.00000	1.29150	0.02666		)
(	8.00000	1.37550	0.02384		)
(	9.00000	1.38930	0.02662		)
(	10.00000	1.36160	0.03620		)
(	11.00000	1.36880	0.04597		)
(	12.00000	1.41300	0.05821		)
(	13.00000	1.40370	0.06971		)
(	14.00000	1.34860	0.09344		)
(	15.00000	1.27270	0.11702		)
(	16.00000	1.19420	0.15009		)
(	17.00000	1.09300	0.21723		)
(	18.00000	1.09450	0.26428		)
(	19.00000	1.09340	0.28901		)
(	20.00000	1.07300	0.30931		)
(	25.00000	0.76604	0.17861		)
(	30.00000	0.86603	0.25000		)
(	35.00000	0.93969	0.32899		)
(	40.00000	0.98481	0.41318		)
(	45.00000	1.00000	0.50000		)
(	50.00000	0.98481	0.58682		)
(	55.00000	0.93969	0.67101		)
(	60.00000	0.86603	0.75000		)
(	65.00000	0.76604	0.82139		)
(	70.00000	0.64279	0.88302		)
(	75.00000	0.50000	0.93301		)
(	80.00000	0.34202	0.96985		)
(	85.00000	0.17365	0.99240		)
(	90.00000	0.00000	1.00000		)
(	95.00000	-0.17365	0.99240		)
(	100.00000	-0.34202	0.96985		)
(	105.00000	-0.50000	0.93301		)
(	110.00000	-0.64279	0.88302		)
(	115.00000	-0.76604	0.82139		)
(	120.00000	-0.86603	0.75000		)
(	125.00000	-0.93969	0.67101		)
(	130.00000	-0.98481	0.58682		)
(	135.00000	-1.00000	0.50000		)
(	140.00000	-0.98481	0.41318		)
(	145.00000	-0.93969	0.32899		)
(	150.00000	-0.86603	0.25000		)
(	155.00000	-0.76604	0.17861		)
(	160.00000	-0.64279	0.11698		)
(	165.00000	-0.50000	0.06699		)
(	170.00000	-0.34202	0.03015		)
(	175.00000	-0.17365	0.00760		)
(	180.00000	0.00000	0.00000		)


);

// ************************************************************************* //
