tutorials/NTNU_LES/constant/airfoilProperties/cylinder
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airfoilData
(
//   alpha   C_l    C_d
    (-180.00    0.000   0.5000)
    (   0.00    0.000   0.5000)
    ( 180.00    0.000   0.5000)
);

// ************************************************************************* //
