tutorials/NTNU_LES/constant/turbineProperties/T2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile 
{ 
    version     2.0; 
    format      ascii; 
    class       dictionary; 
    object      turbineProperties; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 


NumBl                   3;

TipRad              	0.447; 	      // in m

HubRad               	0.045;  	  // in m

TowerHt        	 		0.8;          // in m

OverHang        		0.00000001;   // in m

// --- Usually not used for simple cases.

PSpnElN        			1.0000;

UndSling       			0.0000;

HubCM               	0.0000;

NacCMxn         		0.0000;

NacCMyn         		0.0000;

NacCMzn         		0.0000;

Twr2Shft        		0.0000;

TwrRBHt         		0.0000;

ShftTilt        		0.0000;

Delta3               	0.0000;

PreCone          		(0.0000 0.0000 0.0000);

AzimB1Up          		0.0000;

HubIner          		0.0000;

YawRate          		0.0000;

PitchRate          		0.0000;

PitchAmplitude          0.0000;

PitchControllerType     "none";

SpeedControllerType     "none";

YawControllerType       "none";

Airfoils
(
    "cylinder"  	// 0
    "Re65000"   	// 1
    "Re82000"		// 2 
    "Re91000"		// 3
    "Re96000"		// 4
    "Re99000"		// 5
    "Re101000"		// 6
    "Re102000"		// 7 
    "Re103000"		// 8
    "Re104000"		// 9
); 


BladeData
(
	//    radius(m)     Re               Tu             airfoil
	(     0      	 	1000000.000      0.001000000    0		)
	(     0.0447	 	1000000.000      0.001000000    0		)
	(     0.0894    	1000000.000      0.001000000    1		)
	(     0.1341    	1000000.000      0.001000000    2		)
	(     0.1788      	1000000.000      0.001000000    3		)
	(     0.2235    	1000000.000      0.001000000    4		)
	(     0.2682     	1000000.000      0.001000000    5		)
	(     0.3129	   	1000000.000      0.001000000    6		)
	(     0.3576      	1000000.000      0.001000000    7		)
	(     0.4023	   	1000000.000      0.001000000    8		)
	(     0.447	     	1000000.000      0.001000000    9		)
);

rotorDesign
(
	//	radius(m)	c(m)		twist(deg) 	thickness-to-chord-ratio
	(	0.0075		0.0135		120		    0   						)
	(	0.0225		0.0135		120		    0   						)
	(	0.049		0.0135		120		    0   						)
	(	0.055		0.0495		38		    0   						)
	(	0.0675		0.081433	37.055	    0   						)
	(	0.0825		0.080111	32.544	    0   						)
	(	0.0975		0.077012	28.677	    0   						)
	(	0.1125		0.073126	25.262	    0   						)
	(	0.1275		0.069008	22.43	    0   						)
	(	0.1425		0.064952	19.988	    0   						)
	(	0.1575		0.061102	18.034	    0   						)
	(	0.1725		0.05752		16.349	    0   						)
	(	0.1875		0.054223	14.663	    0   						)
	(	0.2025		0.051204	13.067	    0   						)
	(	0.2175		0.048447	11.829	    0   						)
	(	0.2325		0.045931	10.753	    0   						)
	(	0.2475		0.043632	9.8177	    0   						)
	(	0.2625		0.041529	8.8827	    0   						)
	(	0.2775		0.039601	7.9877	    0   						)
	(	0.2925		0.037831	7.2527	    0   						)
	(	0.3075		0.036201	6.565	    0   						)
	(	0.3225		0.034697	5.9187	    0   						)
	(	0.3375		0.033306	5.3045	    0   						)
	(	0.3525		0.032017	4.7185	    0   						)
	(	0.3675		0.030819	4.1316	    0   						)
	(	0.3825		0.029704	3.5439	    0   						)
	(	0.3975		0.028664	2.9433	    0   						)
	(	0.4125		0.027691	2.2185	    0   						)
	(	0.4275		0.02678		1.097	    0   						)
	(	0.4425		0.025926	-0.7167	    0   						)
);

// ************************************************************************* //
