tutorials/NTNU_LES/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

uin (10 0.0 0.0);

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $uin;

boundaryField
{
    INLET
    {
        type            fixedValue;
        value           uniform $uin;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    BOTTOM
    {
        type            symmetry;
    }
    TOP
    {
        type            symmetry;
    }
    LEFT
    {
        type            symmetry;
    }
    RIGHT
    {
        type            symmetry;
    }
}


// ************************************************************************* //
