tutorials/NTNU_LES/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default        				  	backward;
}

gradSchemes
{
    default         			  	Gauss linear;
}

divSchemes
{
    default         			  	none;
    div(phi,U)      			  	Gauss limitedLinearV 1;
    div(phi,k)      			  	Gauss limitedLinear 1;
    div(phi,omega)  			  	Gauss limitedLinear 1;
    div((nuEff*dev2(T(grad(U))))) 	Gauss linear;
}

laplacianSchemes
{
    default         				Gauss linear corrected;
}

interpolationSchemes
{
    default         				linear;
}

snGradSchemes
{
    default         				corrected;
}

fluxRequired
{
    default         				no;
    p               				;
}

// ************************************************************************* //
