tutorials/NTNU_LES/system/functionObjects/FOsolve
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

solverInfo
{
    type            	solverInfo;
    libs            	("libutilityFunctionObjects.so");
    fields          	(U p);
    writeResidualFields no;
}
