tutorials/NTNU_LES/system/functionObjects/FOturbulenceFields
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

turbulenceFields1
{
	// Mandatory Entries
    type            turbulenceFields;
    libs            (fieldFunctionObjects);
	fields 			("k");
	// --- Valid fields
	// fields          (k epsilon omega nuTilda nut nuEff R devReff L);

    // Optional (inherited) entries
    region          region0;
    enabled         true;
    log             true;
    timeStart       0;
    executeControl  timeStep;
    executeInterval 1; 
    writeControl    writeTime;
    writeInterval   1; 

}

// ************************************************************************* //
